[
  {
    "project_title": "The Ability to Address Complex Socio-Technical Systems",
    "department": "Engineering Education",
    "faculty_mentor": "",
    "terms_available": "Fall, Spring, Summer",
    "student_level": "Freshman, Sophomore, Junior, Senior, 2 students a term",
    "prerequisites": "Interest in Engineering Education",
    "credit": "1-2 credits via EGN 4912",
    "stipend": "None unless selected for University Scholars",
    "application_requirements": "Basic online application, Resume, UF unofficial transcripts, Faculty interview, email one pdf file with all application requirements to John Mendoza-Garcia, jmendozagarcia@ufl.edu",
    "application_deadline": "March 1 for Summer and Fall terms and November 1 for the Spring Term",
    "website": "http://www.johnmendozagarcia.com",
    "project_description": "This project is investigating the Ability to Address Complex Socio-Technical Systems. This ability encompasses what an engineering student needs to learn to be able to create engineering solutions that satisfy the needs and expectations of different stakeholders (e.g. customers, regulation entities, boards of directors, etc). Research questions: What is this ability? How is it learned or developed? How can it be assessed? How can it be effectively taught? Research methods: Qualitative to understand its learning and generate the assessment tools (phenomenography and content analysis). Quantitative to assess the effectiveness of its teaching, and standardize its assessment.",
    "ph.d._student_mentor(s)": "N/A",
    "contact_email": "jmendozagarcia@ufl.edu",
    "source": "https://www.eng.ufl.edu/graduate/current-students/undergraduate-research/research-projects/institute-for-excellence-in-engineering-education/",
    "project_id": "institute_for_excellence_in_engineering_education_1"
  },
  {
    "project_title": "Engineering communities enacting transformational change addressing the social implications of the engineering practice",
    "department": "Engineering Education",
    "faculty_mentor": "",
    "terms_available": "Fall, Spring, Summer",
    "student_level": "Freshman, Sophomore, Junior, Senior, 2 students a term",
    "prerequisites": "Interest in Engineering Education and acquiring research skills",
    "credit": "1-2 credits via EGN 4912",
    "stipend": "None unless selected for University Scholars. Benefit: Potentially getting a publication.",
    "application_requirements": "Basic online application. Send an email to Dr. Rivera at rivera.jimenez@eng.ufl.edu with the following: 1) your resume; 2) a cover letter or statement (2 pages max) describing your qualifications and motivation for the job; and 3) UF unofficial transcripts. Interviews via Zoom are expected to start as soon as applications are received.",
    "application_deadline": "Open until the drop add period for each semester until all positions are filled.",
    "website": "https://theengineeringprofessor.org/research/",
    "project_description": "Our group is looking for an undergraduate student to develop a rigorous systematic literature review summarizing the best practices for engineering communities enacting transformational change for social justice. Transformational change refers to a frame-breaking change that completely alters the current operating structure, such as processes, people, and technology. A systematic review is defined as a review of the evidence on a clearly formulated question that uses systematic and explicit methods to identify, select, and critically appraise relevant primary research and extract and analyze data from the studies included in the review. Social implications in the engineering practice may involve concepts of peace/non-peace, gender equality, care for the environment, poverty, and public safety, and social justice. The research will include an in-depth literature review using commonly known databases (e.g., Web of Science, Academic Search Premier, Scopus), the use of analysis software (e.g., Endnote, MAXQDA, Covidence), and dissemination (i.e., journal publication and presentation). This opportunity will require the student to manage an undergraduate research project by dedicating around 10-15 hours per week. The participant will also gain valuable experience that will make them a more qualified candidate upon graduation. The student will end this experience with a written research portfolio including but not limited to a research proposal, report, literature review, and blog pieces.",
    "ph.d._student_mentor(s)": "N/A",
    "contact_email": "rivera.jimenez@eng.ufl.edu",
    "source": "https://www.eng.ufl.edu/graduate/current-students/undergraduate-research/research-projects/institute-for-excellence-in-engineering-education/",
    "project_id": "institute_for_excellence_in_engineering_education_2"
  },
  {
    "project_title": "Systematic Review on the social implications of the engineering practice",
    "department": "Engineering Education",
    "faculty_mentor": "",
    "terms_available": "Fall, Spring, Summer",
    "student_level": "Freshman, Sophomore, Junior, Senior, 2-3 students a term",
    "prerequisites": "Interest in Engineering Education and acquiring research skills",
    "credit": "1-2 credits via EGN 4912",
    "stipend": "None unless selected for University Scholars.",
    "application_requirements": "Basic online application. Send an email to Dr. Rivera at rivera.jimenez@eng.ufl.edu with the following: 1) your resume; 2) a cover letter or statement (2 pages max) describing your qualifications and motivation for the job; and 3) UF unofficial transcripts. Interviews via Zoom are expected to start as soon as applications are received.",
    "application_deadline": "The last day of drop add period for all terms.",
    "website": "https://theengineeringprofessor.org/research/",
    "project_description": "Goal: Complete a systematic Review for publication submission in February 2022 on the topic of social implications of the engineering practice",
    "ph.d._student_mentor(s)": "N/A",
    "contact_email": "rivera.jimenez@eng.ufl.edu",
    "source": "https://www.eng.ufl.edu/graduate/current-students/undergraduate-research/research-projects/institute-for-excellence-in-engineering-education/",
    "project_id": "institute_for_excellence_in_engineering_education_3"
  },
  {
    "project_title": "Influence National Professional Societies in Facilitating Chemical Engineering Faculty Agency",
    "department": "Engineering Education",
    "faculty_mentor": "",
    "terms_available": "Fall, Spring, Summer",
    "student_level": "Freshman, Sophomore, Junior, Senior, 2-3 students a term",
    "prerequisites": "Interest in Engineering Education and acquiring research skills",
    "credit": "1-2 credits via EGN 4912",
    "stipend": "None unless selected for University Scholars.",
    "application_requirements": "Basic online application. Send an email to Dr. Rivera at rivera.jimenez@eng.ufl.edu with the following: 1) your resume; 2) a cover letter or statement (2 pages max) describing your qualifications and motivation for the job; and 3) UF unofficial transcripts. Interviews via Zoom are expected to start as soon as applications are received.",
    "application_deadline": "The last day of drop add period for all terms. Contact Dr. Rivera to verify if all positions were filled.",
    "website": "https://theengineeringprofessor.org/research/ or https://www.nsf.gov/awardsearch/showAward?AWD_ID=2106206&HistoricalAwards=false",
    "project_description": "Our group is looking for an undergraduate student to coordinate a new NSF-funded qualitative research project exploring the strategic agency of chemical engineering faculty involved in professional societies (e.g., AIChE) as they transform their teaching practices. The student will directly assist the principal investigator in the literature review, ethically validate data collection methods, recruit the study faculty participants through AIChE, facilitate a workshop with the PI during AIChE national, and meet with the project advisory board.",
    "ph.d._student_mentor(s)": "N/A",
    "contact_email": "rivera.jimenez@eng.ufl.edu",
    "source": "https://www.eng.ufl.edu/graduate/current-students/undergraduate-research/research-projects/institute-for-excellence-in-engineering-education/",
    "project_id": "institute_for_excellence_in_engineering_education_4"
  },
  {
    "project_title": "NSF International Research Experiences for Students in South Korea",
    "department": "Engineering Education",
    "faculty_mentor": "",
    "terms_available": "Summer",
    "student_level": "Sophomore, Junior, 2-3 UF students in Summer 2022",
    "prerequisites": "1 semester of undergraduate research experience, any engineering discipline.",
    "credit": "1-2 credits via EGN 4912",
    "stipend": "$4000 for 8 weeks + international travel support",
    "application_requirements": "Basic online application, Resume, UF unofficial transcripts, letters of recommendation, and statement of research interest; Online at https://nsfirika.org/",
    "application_deadline": "January 15, 2022",
    "website": "https://nsfirika.org/",
    "project_description": "Interdisciplinary Research in Korea on Applied smart systems (IRiKA) for Undergraduate Students will provide a cohort of five US undergraduate students per year with the opportunity to conduct research for 8 weeks at Korea’s top-ranked universities with state-of-the-art research facilities. IRiKA is a competitive program. Selected students will receive a stipend and international travel support. For more info, visit: https://nsfirika.org/",
    "ph.d._student_mentor(s)": "N/A",
    "contact_email": "gloriakim@ufl.edu",
    "source": "https://www.eng.ufl.edu/graduate/current-students/undergraduate-research/research-projects/institute-for-excellence-in-engineering-education/",
    "project_id": "institute_for_excellence_in_engineering_education_5"
  }
]